var data = {
    'mobile-menu': {
        template: {
            id: '', // для автоматических тестов
            direction: '', // ya-from-left, ya-from-right
            text_open: '',
            list: [
                {
                    mod: '', // опция
                    modalId: '', // опция
                    href: '', // опция
                    img: {
                        name: '',
                        width: '',
                    }, // опция
                    pointerRight: 'true', // опция
                    text: '', // опция
                    list: [
                        {
                            mod: '', // опция
                            href: '', // опция
                            img: {
                                width: '',
                                name: '',
                            }, // опция
                            text: '', // опция
                        }
                    ], // опция
                }
            ]
        },
        example_left: {
            direction: 'ya-from-left', // ya-from-left, ya-from-right
            text_open: 'Мобильное меню слева',
            list: [
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                }
            ]
        },
        example_right: {
            direction: 'ya-from-right', // ya-from-left, ya-from-right
            text_open: 'Мобильное меню справа',
            list: [
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                },
                {
                    text: 'Пункт меню', // опция
                    list: [
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        },
                        {
                            href: '№', // опция
                            text: 'Это подменю', // опция
                        }
                    ], // опция
                }
            ]
        }
    }
};